In [16]:
import pandas as pd
from sqlalchemy import create_engine

In [17]:
# Connect to postgres DB
connection = create_engine("postgresql+psycopg2://Tsega:Ebunoluwa@localhost:5432/DataProjects")

In [18]:
# importing the table as a dataframe
icos = pd.read_sql("SELECT * FROM icos", connection)
category = pd.read_sql("SELECT * FROM category", connection)
platform = pd.read_sql("SELECT * FROM platform", connection)
date = pd.read_sql("SELECT * FROM date", connection)
project = pd.read_sql("SELECT * FROM project", connection)
token_role = pd.read_sql("SELECT * FROM token_role", connection)

icos

,id,dateid,projectid,platformid,categoryid,token_roleid,raised_usd,ico_price,fundraise_goal,total_token,sold
0,ICO0,DA0,PRO0,PLAT0,CAT0,TR0,6600000.0,NaN,NaN,1.000000e+09,15.60
1,ICO1,DA39,PRO46,PLAT0,CAT0,TR0,240000.0,0.250,240000.0,NaN,NaN
2,ICO2,DA309,PRO367,PLAT0,CAT0,TR0,6600000.0,0.360,28800000.0,1.000000e+09,NaN
3,ICO3,DA309,PRO368,PLAT2,CAT2,TR0,5500000.0,0.010,200000.0,1.000000e+10,NaN
4,ICO4,DA309,PRO369,PLAT1,CAT4,TR0,1810000.0,0.160,50000.0,1.000000e+08,NaN
...,...,...,...,...,...,...,...,...,...,...,...
1358,ICO1362,DA1170,PRO1296,PLAT3,CAT22,TR0,300000.0,0.150,300000.0,1.000000e+10,5.00
1359,ICO279,DA144,PRO179,PLAT2,CAT1,TR0,28250000.0,0.500,20000000.0,1.000000e+09,11.22
1360,ICO961,DA688,PRO787,PLAT2,CAT2,TR0,150000.0,0.100,150000.0,8.000000e+08,31.25
1361,ICO962,DA1230,PRO787,PLAT2,CAT2,TR0,150000.0,0.065,200000.0,8.000000e+08,31.25
1362,ICO879,DA64,PRO78,PLAT2,CAT2,TR0,3940000.0,0.100,750000.0,2.000000e+08,20.73

In [19]:
# The top 10 ICO categories that raised the highest
query = '''SELECT
                category.category_name,
                CAST(SUM(raised_usd) AS BIGINT) AS Total_raised
            FROM
                icos
            JOIN
                category ON icos.categoryid = category.categoryid
            WHERE
                raised_usd IS NOT NULL
            GROUP BY
                category.category_name
            ORDER BY
                Total_raised DESC
            LIMIT 10'''

top10categories = pd.read_sql(query, connection)

top10categories

        category_name  total_raised
0  Blockchain Service   11949447238
1                DeFi    3697332500
2            Exchange    1715070000
3            Protocol    1136145000
4            Platform    1077315000
5              Gaming     959195948
6             Network     785830000
7   Marketing Service     183260000
8         Marketplace     171218295
9        KYC/Security     154560000

In [20]:
# The top 10 ICO platform that raised the highest
query = '''SELECT
                platform.platforn_name,
                CAST(SUM(raised_usd) AS BIGINT) AS Total_raised
            FROM
                icos
            JOIN
                platform ON icos.platformid = platform.platformid
            WHERE
                raised_usd IS NOT NULL
            GROUP BY
                platform.platforn_name
            ORDER BY
                Total_raised DESC
            LIMIT 10'''

top10platform = pd.read_sql(query, connection)

top10platform

    platforn_name  total_raised
0        Ethereum   19725472763
1  Own Blockchain    1138430000
2   Binance Chain     750603718
3          Solana     411980000
4        Polkadot     193865000
5  NEO Blockchain     141900000
6         Polygon      59840000
7  Cosmos Network      54060000
8        Algorand      53730000
9   Nebulas Chain      30000000

In [21]:
# Token roles that raised the highest?
query = '''SELECT
            token_role.token_role,
            CAST(SUM(raised_usd) AS BIGINT) AS Total_raised
        FROM
            icos
        JOIN
            token_role ON icos.token_roleid = token_role.token_roleid
        WHERE
            raised_usd IS NOT NULL
        GROUP BY
            token_role.token_role
        ORDER BY
            Total_raised DESC'''

tokenroles = pd.read_sql(query, connection)

tokenroles

   token_role  total_raised
0     Utility   22187113981
1  Governance     514920000
2    Security      34870000

In [22]:
# The start quarter that raised the highest?
query = '''SELECT 
                CASE 
                    WHEN date.start_month BETWEEN 1 AND 3 THEN 'Q1'
                    WHEN date.start_month BETWEEN 4 AND 6 THEN 'Q2'
                    WHEN date.start_month BETWEEN 7 AND 9 THEN 'Q3'
                    WHEN date.start_month BETWEEN 10 AND 12 THEN 'Q4'
                END AS Start_quarter,
                COUNT(projectid) AS Total_projects,
                CAST(SUM(raised_usd) AS BIGINT) AS Total_raised
            FROM
                icos
            JOIN
                date ON icos.dateid = date.dateid
            WHERE
                raised_usd IS NOT NULL
            GROUP BY
                Start_quarter
            ORDER BY
                Total_raised DESC'''

quarter = pd.read_sql(query, connection)

quarter

  start_quarter  total_projects  total_raised
0            Q2             391    9411483408
1            Q1             290    5072531548
2            Q3             270    4834004025
3            Q4             320    3418885000

In [23]:
# Projects whose raised amount surpases their fundraise goal.
# Calculate the percentage if or not raised_usd is greater than fundraise goal
query = '''SELECT 
                ROUND((COUNT(CASE WHEN raised_usd > fundraise_goal THEN 1 END) * 100.0) / COUNT(*), 2) AS percentage_true,
                ROUND((COUNT(CASE WHEN raised_usd < fundraise_goal THEN 1 END) * 100.0) / COUNT(*), 2) AS percentage_false,
                ROUND((COUNT(CASE WHEN raised_usd = fundraise_goal THEN 1 END) * 100.0) / COUNT(*), 2) AS percentage_equal
            FROM
                icos
            WHERE
                raised_usd IS NOT NULL
                AND fundraise_goal IS NOT NULL'''

percentage_raised = pd.read_sql(query, connection)

percentage_raised

   percentage_true  percentage_false  percentage_equal
0            70.56              9.98             19.46

In [26]:
query = 'SELECT * FROM BigICOs'

temp_table = pd.read_sql(query, connection)

temp_table

,project_name,start_date,end_date,category_name,platforn_name,total_token,ico_price,fundraise_goal,raised_usd,sold
0,Casper,2021-04-07,2021-04-07,Blockchain Service,Own Blockchain,1.000000e+10,0.03,3000000.0,62900000.0,39.70
1,Findora,2021-04-04,2021-04-05,Network,Own Blockchain,2.100000e+10,0.08,50050.0,21050000.0,3.98
2,Boson Protocol,2021-04-07,2021-04-09,Protocol,Ethereum,2.000000e+08,4.30,25800000.0,37600000.0,3.00
3,Covalent,2021-04-29,2021-04-30,Blockchain Service,Ethereum,1.000000e+09,0.35,9450000.0,14440000.0,56.50
4,CLV,2021-05-04,2021-05-04,Blockchain Service,Polkadot,1.000000e+09,0.20,30000000.0,57400000.0,17.50
...,...,...,...,...,...,...,...,...,...,...
59,Injective Protocol,2020-10-19,2020-10-20,Exchange,Ethereum,1.000000e+08,0.40,3600000.0,43600000.0,9.00
60,Radix DLT,2020-10-08,2020-10-22,Blockchain Service,Ethereum,4.200000e+09,0.04,28080000.0,12840000.0,16.40
61,Oxygen,2021-03-11,2021-03-12,Blockchain Service,Ethereum,1.000000e+10,0.10,20000000.0,20000000.0,2.00
62,Archway,2023-06-15,2023-06-23,Blockchain Service,Cosmos Network,1.000000e+09,0.20,6000000.0,27000000.0,19.50
63,Arkham,2023-07-11,2023-07-18,Blockchain Service,Binance Chain,1.000000e+09,0.05,2500000.0,12000000.0,5.00

In [27]:
# Analyze the distribution of ICOs based on the percentage of sold tokens
query = '''SELECT
                sold_range,
                COUNT(sold_range) AS Total
            FROM (
                SELECT *,
                    CASE 
                        WHEN sold < 10 THEN 'Less than 10%%'
                        WHEN sold BETWEEN 10 AND 25 THEN '10%% - 25%%'
                        WHEN sold BETWEEN 25 AND 50 THEN '25%% - 50%%'
                        WHEN sold BETWEEN 50 AND 75 THEN '50%% - 75%%'
                        WHEN sold BETWEEN 75 AND 100 THEN '75%% - 100%%'
                    END AS Sold_range
                FROM BigICOs
            ) AS T1
            GROUP BY 1
            ORDER BY 2 DESC'''

range_of_token_sold = pd.read_sql(query, connection)

range_of_token_sold

      sold_range  total
0      10% - 25%     29
1  Less than 10%     19
2      25% - 50%     14
3      50% - 75%      2

In [28]:
# Was the amount raised was based of the token price during the ICO
# Analyze the distribution of ICOs based on the token price during the ICO
query = '''SELECT
                Price_range,
                COUNT(Price_range) AS Total
            FROM (
                SELECT *,
                    CASE 
                        WHEN ico_price < 0.01 THEN 'Less than $0.01'
                        WHEN ico_price BETWEEN 0.01 AND 1.00 THEN '$0.01 -  $1.00'
                        WHEN ico_price BETWEEN 1.00 AND 5.00 THEN '$1.00 -  $5.00'
                        WHEN ico_price BETWEEN 5.00 AND 20.00 THEN '$5.00 -  $20.00'
                        WHEN ico_price BETWEEN 20.00 AND 50.00 THEN '$20.00 -  $50.00'
                        WHEN ico_price BETWEEN 50.00 AND 100.00 THEN '$50.00 -  $100.00'
                        WHEN ico_price BETWEEN 100.00 AND 250.00 THEN '$100.00 -  $250.00'
                        WHEN ico_price BETWEEN 250.00 AND 500.00 THEN '$250.00 -  $500.00'
                        WHEN ico_price BETWEEN 500.00 AND 750.00 THEN '$500.00 -  $750.00'
                        WHEN ico_price BETWEEN 750.00 AND 1000.00 THEN '$750.00 -  $1000.00'
                        WHEN ico_price > 1000.00 THEN 'Above $1k'
                    END AS Price_range
                FROM BigICOs
            ) AS T1
            GROUP BY 1
            ORDER BY 2 DESC'''

amount_raised = pd.read_sql(query, connection)

amount_raised

       price_range  total
0   $0.01 -  $1.00     52
1   $1.00 -  $5.00      6
2  $5.00 -  $20.00      3
3  Less than $0.01      3